Tekla Open API Reference for Tekla Structures 2025
SurfacingMarkPropertyElementTypes Methods
The PropertyElement.PropertyElementType.SurfacingMarkPropertyElementTypes type exposes the following members.
Methods
Name | Description
Class
Returns the class property element type.
Code
Returns the code property element type.
Material
Returns the material property element type.
Name
Returns the name property element type.
SurfaceTreatmentName
Returns the surface treatment name property element type.
Top
See Also
Reference
PropertyElement.PropertyElementType.SurfacingMarkPropertyElementTypes Class
Tekla.Structures.Drawing Namespace